#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/4e38ed41-25cd-4404-902b-7bd891b1e2f5/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.project-factory.google_resource_manager_lien.lien[0] will be created
  + resource "google_resource_manager_lien" "lien" {
      + create_time  = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + origin       = "project-factory"
      + parent       = "projects/658555706780"
      + reason       = "Project Factory lien"
      + restrictions = [
          + "resourcemanager.projects.delete",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_resource_manager_lien.lien[0] will be created%0A  + resource "google_resource_manager_lien" "lien" {%0A      + create_time  = (known after apply)%0A      + id           = (known after apply)%0A      + name         = (known after apply)%0A      + origin       = "project-factory"%0A      + parent       = "projects/658555706780"%0A      + reason       = "Project Factory lien"%0A      + restrictions = [%0A          + "resourcemanager.projects.delete",%0A        ]%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*